<?php
$string['pluginname'] = 'إعادة توجيه تسجيل الدخول حسب الدور';
$string['settingsheading'] = 'إعادة توجيه تسجيل الدخول حسب الدور';
$string['redirectroleid'] = 'الأدوار المطلوب إعادة توجيهها';
$string['redirectroleid_desc'] = 'سيتم إعادة توجيه المستخدمين الذين لديهم هذه الأدوار (في أي سياق) بعد تسجيل الدخول.';
$string['courseid'] = 'معرف المقرر الذي سيتم إعادة التوجيه إليه';
$string['courseid_desc'] = 'معرف المقرر الرقمي (على سبيل المثال <em>X</em> في .../course/view.php?id=<em>X</em>).<br><em>إذا كان فارغًا أو غير صالح، فلن يتم إعادة التوجيه.</em>';
$string['privacy:metadata'] = 'لا يقوم مكون إعادة توجيه تسجيل الدخول حسب الدور بتخزين أي بيانات شخصية.';
$string['accessdenied'] = 'لم يعد لديك إذن للوصول إلى صفحة الإعدادات هذه.';
$string['excludedroleids'] = 'الأدوار المستثناة';
$string['excludedroleids_desc'] = 'حدد أي أدوار يجب ألا يتم إعادة توجيهها <strong>أبدًا</strong>، حتى إذا كان المستخدم لديه أحد الأدوار المحددة لإعادة التوجيه. هذه الأدوار لها أولوية على قائمة إعادة التوجيه.';
$string['enrolrole'] = 'الدور للتسجيل التلقائي';
$string['enrolrole_desc'] = 'سيتم تسجيل المستخدمين الذين تتم إعادة توجيههم تلقائيًا في المقرر المستهدف بهذا الدور.';
